title: DeviceEvents
description: Multiple event types, such as process injection, creation of scheduled
  tasks, and LSASS access attempts
platform: windows
log_source: windowsdefenderatp
event_code: DeviceEvents
event_version: '0'
event_fields:
- name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- name: FileName
  type: string
  description: Name of the file that the recorded action was applied to
  sample_value: ''
- name: FolderPath
  type: string
  description: Folder containing the file that the recorded action was applied to
  sample_value: ''
- name: SHA1
  type: string
  description: SHA-1 of the file that the recorded action was applied to
  sample_value: ''
- name: MD5
  type: string
  description: MD5 hash of the file that the recorded action was applied to
  sample_value: ''
- name: AccountDomain
  type: string
  description: Domain of the account
  sample_value: ''
- name: AccountName
  type: string
  description: User name of the account
  sample_value: ''
- name: AccountSid
  type: string
  description: Security Identifier (SID) of the account
  sample_value: ''
- name: RemoteUrl
  type: string
  description: URL or fully qualified domain name (FQDN) that was being connected
    to
  sample_value: ''
- name: RemoteDeviceName
  type: string
  description: Name of the machine that performed a remote operation on the affected
    machine. Depending on the event being reported, this name could be a fully-qualified
    domain name (FQDN), a NetBIOS name, or a host name without domain information.
  sample_value: ''
- name: ProcessId
  type: int
  description: Process ID (PID) of the newly created process
  sample_value: ''
- name: ProcessCommandLine
  type: string
  description: Command line used to create the new process
  sample_value: ''
- name: ProcessCreationTime
  type: date
  description: Date and time the process was created
  sample_value: ''
- name: ProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control
    (UAC) privilege elevation applied to the newly created process
  sample_value: ''
- name: LogonId
  type: string
  description: Identifier for a logon session. This identifier is unique on the same
    machine only between restarts.
  sample_value: ''
- name: RegistryKey
  type: string
  description: Registry key that the recorded action was applied to
  sample_value: ''
- name: RegistryValueName
  type: string
  description: Name of the registry value that the recorded action was applied to
  sample_value: ''
- name: RegistryValueData
  type: string
  description: Data of the registry value that the recorded action was applied to
  sample_value: ''
- name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- name: LocalIP
  type: string
  description: IP address assigned to the local machine used during communication
  sample_value: ''
- name: LocalPort
  type: int
  description: TCP port on the local machine used during communication
  sample_value: ''
- name: FileOriginUrl
  type: string
  description: URL where the file was downloaded from
  sample_value: ''
- name: FileOriginIP
  type: string
  description: IP address where the file was downloaded from
  sample_value: ''
- name: AdditionalFields
  type: string
  description: Additional information about the event in JSON array format
  sample_value: ''
- name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- name: InitiatingProcessSHA256
  type: string
  description: SHA-256 of the process (image file) that initiated the event. This
    field is usually not populated-use the SHA1 column when available.
  sample_value: ''
- name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible
    for the event
  sample_value: ''
- name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for
    the event
  sample_value: ''
- name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event
    was started
  sample_value: ''
- name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible
    for the event
  sample_value: ''
- name: InitiatingProcessLogonId
  type: string
  description: Identifier for a logon session of the process that initiated the event.
    This identifier is unique on the same machine only between restarts.
  sample_value: ''
- name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events,
    this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard
    to isolate browser activity
  sample_value: ''
references: []
tags: []
